STMicroelectronics/STM32CubeL5/Projects/STM32L562E-DK/Applications/TFM/TFM_SBSFU/Src/bl2_nv_services.c
/**
  ******************************************************************************
  * @file    bl2_nv_service.c
  * @author  MCD Application Team
  * @brief   This file provides all the Non volatile firmware functions.
  @verbatim
  ==============================================================================

                   ##### How to use this driver #####
  ==============================================================================
    [..]
      This driver provides functions to initialize Non Volatile Storage, to read and
      write Non volatile Monothonic Counters.

      (#) NVCNT initialization functions:
               (++) Initialize NVCNT using tfm_plat_init_nv_counter fucntion,
         it must be performed at system start up.
         At first boot, on a virgin flash, the NV area is formatted and
         HUK seed (32bits) is randomly generated and written in NV area.

      (#) NVCNT counter access functions:
           (++) Write Monothonic counter using tfm_plat_set_nv_counter or tfm_plat_set_nv_counter functions
                A Clean Up request can be raised as return parameter in case
                FLASH pages used by EEPROM emulation, are full.
           (++) Read monothonic counter using tfm_plat_read_nv_counter functions

  @endverbatim
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics International N.V.
  * All rights reserved.</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other
  *    contributors to this software may be used to endorse or promote products
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under
  *    this license is void and will automatically terminate your rights under
  *    this license.
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "string.h"
#include "platform/include/tfm_plat_nv_counters.h"
#ifdef TFM_DEV_MODE
#define BOOT_LOG_LEVEL BOOT_LOG_LEVEL_INFO
#else
#define BOOT_LOG_LEVEL BOOT_LOG_LEVEL_OFF
#endif /* TFM_DEV_MODE */
#include "bootutil/bootutil_log.h"
#include "tfm_boot_status.h"
#include "boot_record.h"
#include "entropy_poll.h"
#include <limits.h>
#include "Driver_Flash.h"
#include "flash_layout.h"
#include "stm32l5xx_ll_crc.h"
#include "stm32l5xx_ll_bus.h"

/** @defgroup NVCNT Implementation NVCNT Implementation
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/** @defgroup NVCNT_Private_Structures NVCNT Private Structures
  * @{
  */


/**
  * @brief  NVCNT State Type structure definition.
  */

/**
  * @}
  */

/* Private variables ---------------------------------------------------------*/
/** @defgroup NVCNT_Private_Variables NVCNT Private Variables
  * @{
  */
extern ARM_DRIVER_FLASH FLASH_DEV_NAME;
/*  HUK is 32 bytes , each element of 8 bytes contains 4 bytes of data */
#define HUK_SIZE 32U
#define NVCNT_ID_HUK ((NVCNT_ID_TYPE)0x4855)
#define PAGE_HEADER_SIZE  (2*HUK_SIZE)
#define NVCNT_HEADER_VALUE (uint32_t)(0xaaddeecc)
/* Global variables used to store eeprom status */
static uint32_t uhNbWrittenElements = 0U;                  /*!< Nb of elements written in valid and active pages */
static uint32_t uwAddressNextWrite = PAGE_HEADER_SIZE;     /*!< Initialize write position just after page header */

/**
  * @}
  */
/* Private configuration  -----------------------------------------------*/
/** @defgroup NVCNT_Private_configuration NVCNT Private configuration
  * @{
  */
/* Configuration of crc calculation for eeprom emulation in flash */
#define NVCNT_ID_TYPE  uint16_t                      /*!< Type of Virtual Address */
#define NVCNT_ID_SHIFT 0U                            /*!< Bits Shifting to get Virtual Address in element */
#define NVCNT_CRC_TYPE             uint16_t                      /*!< Type of Crc */
#define NVCNT_CRC_SHIFT            16U                           /*!< Bits Shifting to get Crc in element */
#define NVCNT_DATA_TYPE            uint32_t                      /*!< Type of Data */
#define NVCNT_DATA_SHIFT           32U                           /*!< Bits Shifting to get Data value in element */
#define NVCNT_MASK_ID              (uint64_t)0x000000000000FFFFU
#define NVCNT_MASK_CRC             (uint64_t)0x00000000FFFF0000U
#define NVCNT_MASK_DATA            (uint64_t)0xFFFFFFFF00000000U
#define NVCNT_MASK_FULL            (uint64_t)0xFFFFFFFFFFFFFFFFU
/*!< Get Crc value from element value */
#define NVCNT_CRC_VALUE(__ELEMENT__) (NVCNT_CRC_TYPE)(((__ELEMENT__) & NVCNT_MASK_CRC) >> NVCNT_CRC_SHIFT)
/*!< Get element value from id, data and crc values */
#define NVCNT_ELEMENT_VALUE(__ID__,__DATA__,__CRC__) (((NVCNT_ELEMENT_TYPE)(__DATA__) << NVCNT_DATA_SHIFT)\
                                                      | (__CRC__) << NVCNT_CRC_SHIFT | (__ID__))
#define CRC_POLYNOMIAL_LENGTH   LL_CRC_POLYLENGTH_16B /* CRC polynomial lenght 16 bits */
#define CRC_POLYNOMIAL_VALUE    0x8005U /* Polynomial to use for CRC calculation */
#define NVCNT_ELEMENT_TYPE uint64_t
#define NVCNT_ELEMENT_SIZE sizeof(NVCNT_ELEMENT_TYPE)
/*!< Flash value after erase */
#define NVCNT_PAGESTAT_ERASED (uint64_t)0xFFFFFFFFFFFFFFFFU /*!< Flash value after erase */
#define NVCNT_MAX_WRITTEN_ELEMENTS ((BL2_NV_COUNTERS_AREA_SIZE - PAGE_HEADER_SIZE) / NVCNT_ELEMENT_SIZE)
/*!< Get id value from element value */
#define NVCNT_ID_VALUE(__ELEMENT__) (NVCNT_ID_TYPE)((__ELEMENT__) & NVCNT_MASK_ID)
/*!< Get Data value from element value*/
#define NVCNT_DATA_VALUE(__ELEMENT__) (NVCNT_DATA_TYPE)(((__ELEMENT__)\
                                                         & NVCNT_MASK_DATA) >> NVCNT_DATA_SHIFT)

#define NVCNT_INIT_VALUE 0U
/* Private function prototypes -----------------------------------------------*/
/** @defgroup NCNT_Private_Functions EEPROM Private Functions
  * @{
  */

