STMicroelectronics/STM32CubeL5/Projects/STM32L562E-DK/Applications/TFM/TFM_SBSFU/Src/bl2_nv_services.c
static bool VerifyPageFullyErased(uint32_t Address, uint32_t PageSize);
static void ConfigureCrc(void);
static uint16_t CalculateCrc(NVCNT_DATA_TYPE Data, uint16_t CounterIc);
static bool Check_Header(void);
static bool Write_Header(void);
static bool init_counter(void);
/**
  * @}
  */
/* Exported functions -------------------------------------------------------*/
/** @addtogroup EEPROM_Exported_Functions
  * @{
  */

/**
  * @brief  Initialize nv counter storage block if not formatted.
  *         Check consistency of nv counter storage
  *         Initialize global variable for write access.
  *
  * @retval enum tfm_plat_err_t
  *           - TFM_PLAT_ERR_SUCCESS in case of success
  *           - TFM_PLAT_ERR_SYSTEM_ERR in case of error
  */
enum tfm_plat_err_t tfm_plat_init_nv_counter(void)
{

  int32_t  err;
  uint32_t  varidx = 0U;
  NVCNT_ELEMENT_TYPE addressvalue = 0U;
  NVCNT_DATA_TYPE counter_value;

  /*********************************************************************/
  /* Step 0: test if it is a full erased page                          */
  /*********************************************************************/
  if (VerifyPageFullyErased(BL2_NV_COUNTERS_AREA_ADDR, BL2_NV_COUNTERS_AREA_SIZE))
  {
    /* page is fully erase */
    /* no power down/reset is expected during this 1st initialization  */
    /* a regression is required to be able to restart the initialization */
    /*  uncomplete initialization is detected in step 1, and bl2 will */
    /*  not launch installed image*/

    /* Delay to avoid voltage rebounce effect (power down) at start up
       during BL2 NV area initialization period */
    HAL_Delay(500);

    BOOT_LOG_INF("Initializing BL2 NV area : Power down/reset not supported...");
    if (!Write_Header())
    {
      BOOT_LOG_ERR("Init BL2 NV Header area: Failed");
      return TFM_PLAT_ERR_SYSTEM_ERR;
    }
    BOOT_LOG_INF("Init BL2 NV Header area: Done");
    /* initialize nv counter 3 to 0 */
    BOOT_LOG_INF("Initializing BL2 NV Counters");

    if (!init_counter())
    {
      BOOT_LOG_ERR("Init BL2 NV counters : Failed");
      return TFM_PLAT_ERR_SYSTEM_ERR;
    }
    BOOT_LOG_INF("Init BL2 NV counters to 0 : Done");
    BOOT_LOG_INF("BL2 NV Area Initialized : Power Down/reset supported");
  }
  /*********************************************************************/
  /* Step 1: verify header presence                                    */
  /*                                                                   */
  /*********************************************************************/
  BOOT_LOG_INF("Checking BL2 NV area");
  BOOT_LOG_INF("Checking BL2 NV area header");
  if (!Check_Header())
  {
    BOOT_LOG_ERR("Wrong BL2 NV Area header");
    return TFM_PLAT_ERR_SYSTEM_ERR;
  }
  BOOT_LOG_INF("Checking BL2 NV Counter consitency");
  if (tfm_plat_read_nv_counter(PLAT_NV_COUNTER_3, sizeof(counter_value),
                               (uint8_t *)&counter_value) != TFM_PLAT_ERR_SUCCESS)
  {
    BOOT_LOG_ERR("NV Counter Not consitent %d", PLAT_NV_COUNTER_3);
    return TFM_PLAT_ERR_SYSTEM_ERR;
  }
  BOOT_LOG_INF("Consistent BL2 NV Counter %d  = 0x%x", PLAT_NV_COUNTER_3, counter_value);
  if (tfm_plat_read_nv_counter(PLAT_NV_COUNTER_4, sizeof(counter_value),
                               (uint8_t *)&counter_value) != TFM_PLAT_ERR_SUCCESS)
  {
    BOOT_LOG_ERR("NV Counter Not consitent %d", PLAT_NV_COUNTER_4);
    return TFM_PLAT_ERR_SYSTEM_ERR;
  }
  BOOT_LOG_INF("Consistent BL2 NV Counter %d  = 0x%x", PLAT_NV_COUNTER_4, counter_value);

  /*********************************************************************/
  /* Step 2: Initialize eeprom emulation global variables relative     */
  /*                                                                   */
  /*********************************************************************/
  /* Initialize global variables, with elements detected in active page */
  uhNbWrittenElements = 0U;
  uwAddressNextWrite = PAGE_HEADER_SIZE;

  for (varidx = PAGE_HEADER_SIZE; varidx < BL2_NV_COUNTERS_AREA_SIZE; varidx += NVCNT_ELEMENT_SIZE)
  {
    /* Check elements present in active page */
    err = FLASH_DEV_NAME.ReadData(BL2_NV_COUNTERS_AREA_ADDR + varidx, &addressvalue,
                                  sizeof(addressvalue));
    if ((err == ARM_DRIVER_ERROR_SPECIFIC) || (addressvalue != NVCNT_MASK_FULL))
    {
      /* Then increment uhNbWrittenElements and uwAddressNextWrite */
      uhNbWrittenElements++;
      uwAddressNextWrite += NVCNT_ELEMENT_SIZE;
    }
    else /* no more element in the page */
    {
      if (err != ARM_DRIVER_OK)
      {
        return TFM_PLAT_ERR_SYSTEM_ERR;
      }
      break;
    }
  }

  /*********************************************************************/
  /* Step 2 : Check consistancy of PLAT_NV_COUNTER_3 counter history   */
  /*********************************************************************/
  return TFM_PLAT_ERR_SUCCESS;
}

/**
  * @brief  Writes/updates counter data in NV area.
  * @warning This function is not reentrant
  * @param  CounterId to be written
  * @param  Data 32bits data to be written
  * @retval enum tfm_plat_err_t
  *           TFM_PLAT_ERR_SUCCESS on write sucessfully done.
              TFM_PLAT_ERR_MAX_VALUE when max updateable value written
  */
enum tfm_plat_err_t tfm_plat_set_nv_counter(enum tfm_nv_counter_t CounterId,
                                            uint32_t Data)
{
  int32_t err;
  uint32_t crc = 0U;
  NVCNT_ELEMENT_TYPE element;
  NVCNT_DATA_TYPE current_value;
  /* check current value is not already in flash, and is consistent */
  if ((tfm_plat_read_nv_counter(CounterId, sizeof(current_value), (uint8_t *)&current_value)
       != TFM_PLAT_ERR_SUCCESS) || (Data < current_value))
  {
    return TFM_PLAT_ERR_SYSTEM_ERR;
  }
  /* check if same value is requested */
  if (current_value == Data)
  {
    /* nothing to do */
    return TFM_PLAT_ERR_SUCCESS;
  }

  /* Check if pages are full, i.e. max number of written elements achieved */
  if (uhNbWrittenElements >= NVCNT_MAX_WRITTEN_ELEMENTS)
  {
    return TFM_PLAT_ERR_MAX_VALUE;
  }

  /* Calculate crc of variable data and virtual address */
  crc = CalculateCrc(Data, CounterId);
  /*  build element  */
  element = NVCNT_ELEMENT_VALUE(CounterId, Data, crc);
  /* Program variable data + virtual address + crc */
  err = FLASH_DEV_NAME.ProgramData(BL2_NV_COUNTERS_AREA_ADDR + uwAddressNextWrite,
                                   &element,
                                   NVCNT_ELEMENT_SIZE);
  /* If program operation was failed, a Flash error code is returned */
  if (err != ARM_DRIVER_OK)
  {
    return TFM_PLAT_ERR_SYSTEM_ERR;
  }

  /* Increment global variables relative to write operation done*/
  uwAddressNextWrite += NVCNT_ELEMENT_SIZE;
  uhNbWrittenElements++;
  BOOT_LOG_INF("Counter %d set to 0x%x", CounterId, Data);
  return TFM_PLAT_ERR_SUCCESS;
}

/**
  * @brief  Increment/updates counter data in NV area.
  * @warning This function is not reentrant
  * @param  CounterId to be written
   * @retval enum tfm_plat_err_t
  *           TFM_PLAT_ERR_SUCCESS on write sucessfully done.
              TFM_PLAT_ERR_MAX_VALUE when max updateable value written
  */

enum tfm_plat_err_t tfm_plat_increment_nv_counter(
  enum tfm_nv_counter_t counter_id)
{
  uint32_t security_cnt;
  enum tfm_plat_err_t err;

  err = tfm_plat_read_nv_counter(counter_id,
                                 sizeof(security_cnt),
                                 (uint8_t *)&security_cnt);
  if (err != TFM_PLAT_ERR_SUCCESS)
  {
    return err;
  }

