STMicroelectronics/STM32CubeL5/Projects/STM32L562E-DK/Applications/TFM/TFM_SBSFU/Src/bl2_nv_services.c
  if (security_cnt == UINT32_MAX)
  {
    return TFM_PLAT_ERR_MAX_VALUE;
  }

  return tfm_plat_set_nv_counter(counter_id, security_cnt + 1u);
}

enum tfm_plat_err_t tfm_plat_read_nv_counter(enum tfm_nv_counter_t counter_id,
                                             uint32_t size, uint8_t *val)
{
  NVCNT_ELEMENT_TYPE addressvalue = 0U;
  uint32_t counter = 0U;
  uint32_t crc = 0U;
  uint32_t found = 0;
  uint32_t previous_value = 0;
  uint32_t current_value = 0;
  int32_t err;

  if (size < sizeof(NVCNT_DATA_TYPE))
  {
    return TFM_PLAT_ERR_INVALID_INPUT;
  }
  /* Search variable in active page and valid pages until erased page is found
     or in erasing pages until erased page is found */

  /* Set counter index to last element position in the page */
  counter = BL2_NV_COUNTERS_AREA_SIZE - NVCNT_ELEMENT_SIZE;

  /* Check each page address starting from end */
  while (counter >= PAGE_HEADER_SIZE)
  {
    /* Get the current location content to be compared with virtual address */
    err = FLASH_DEV_NAME.ReadData(BL2_NV_COUNTERS_AREA_ADDR + counter, &addressvalue,
                                  sizeof(addressvalue));

    if ((err == ARM_DRIVER_OK) && (addressvalue != NVCNT_PAGESTAT_ERASED))
    {
      /* check a zero is not written , zero is forbidden, zero can be used to clean a value  */
      if (addressvalue == 0)
      {
        return TFM_PLAT_ERR_SYSTEM_ERR;
      }

      /* Compare the read address with the virtual address */
      if (NVCNT_ID_VALUE(addressvalue) == counter_id)
      {
        /* Calculate crc of variable data and virtual address */
        crc = CalculateCrc(NVCNT_DATA_VALUE(addressvalue), NVCNT_ID_VALUE(addressvalue));

        /* if crc verification pass, data is correct and is returned.
           if crc verification fails, data is corrupted and has to be skip */
        if (crc == NVCNT_CRC_VALUE(addressvalue))
        {
          if (found != 1)
          {
            *((uint32_t *)val) = NVCNT_DATA_VALUE(addressvalue);
            previous_value = NVCNT_DATA_VALUE(addressvalue);
            found = 1;
          }
          else
          {

            current_value = NVCNT_DATA_VALUE(addressvalue);
            if (current_value >= previous_value)
            {
              return TFM_PLAT_ERR_SYSTEM_ERR;
            }
            else previous_value = current_value;
          }
        }
      }
    }
    /* Next address location */
    counter -= NVCNT_ELEMENT_SIZE;

  }
  if (found == 1)
  {
    return TFM_PLAT_ERR_SUCCESS;;
  }
  else
  {
    /* Variable is not found */
    return TFM_PLAT_ERR_SYSTEM_ERR;
  }
}
/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @addtogroup EEPROM_Private_Functions
  * @{
  */


/**
  * @brief  Verify if specified page is fully erased.
  *         A page with double ECC error is consider as not fully erased
  * @param  Address page address
  * @param  PageSize page size
  * @retval bool
  *           - false : if Page not erased
  *           - true    : if Page erased
  */
static bool VerifyPageFullyErased(uint32_t Address, uint32_t PageSize)
{
  bool readstatus = true;
  uint32_t counter = 0U;
  int32_t err;
  NVCNT_ELEMENT_TYPE addressvalue;
  /* Check each element in the page */
  while (counter < PageSize)
  {
    err = FLASH_DEV_NAME.ReadData(Address + counter, &addressvalue,
                                  sizeof(addressvalue));

    if ((err != ARM_DRIVER_OK) || (addressvalue != NVCNT_PAGESTAT_ERASED))
    {
      /* In case one element is not erased, reset readstatus flag */
      readstatus = false;
    }
    /* Next address location */
    counter = counter + NVCNT_ELEMENT_SIZE;
  }

  /* Return readstatus value */
  return readstatus;
}


/**
  * @brief  This function configures CRC Instance.
  * @note   This function is used to :
  *         -1- Enable peripheral clock for CRC.
  *         -2- Configure CRC functional parameters.
  * @note   Peripheral configuration is minimal configuration from reset values.
  *         Thus, some useless LL unitary functions calls below are provided as
  *         commented examples - setting is default configuration from reset.
  * @param  None
  * @retval None
  */
static void ConfigureCrc(void)
{
  /* (1) Enable peripheral clock for CRC */
  LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_CRC);

  /* (2) Configure CRC functional parameters */

  /* Configure CRC calculation unit with user defined polynomial */
  LL_CRC_SetPolynomialCoef(CRC, CRC_POLYNOMIAL_VALUE);
  LL_CRC_SetPolynomialSize(CRC, CRC_POLYNOMIAL_LENGTH);
}

/**
  * @brief  This function performs CRC calculation on Data and Virtual Address.
  * @param  Data value of  the eeprom variable.
  * @param  VirtAddress address of the eeprom variable.
  * @retval 16-bit CRC value computed on Data and Virtual Address.
  */
static uint16_t CalculateCrc(NVCNT_DATA_TYPE Data, uint16_t VirtAddress)
{

  /* Reset CRC calculation unit */
  LL_CRC_ResetCRCCalculationUnit(CRC);
  /* crc config */
  ConfigureCrc();

  /* Feed Data and Virtual Address */
  LL_CRC_FeedData32(CRC, Data);
  LL_CRC_FeedData16(CRC, VirtAddress);

  /* Return computed CRC value */
  return (LL_CRC_ReadData16(CRC));
}
/**
  * @brief  This function writes the header of NVM counter area.
  * @retval boolean return true on success
  */
static inline bool Write_Header(void)
{
  /*  a dummy header is set,  a random uint32_t with random id and a CRC is
   *  required for product */
#ifdef TFM_HUK_RANDOM_GENERATION
  __IO NVCNT_DATA_TYPE huk[HUK_SIZE / sizeof(NVCNT_DATA_TYPE)];
  NVCNT_ID_TYPE huk_random_id = NVCNT_ID_HUK;
  size_t len = sizeof(huk);
#else
  __IO NVCNT_DATA_TYPE huk[1];
  NVCNT_ID_TYPE huk_random_id = NVCNT_ID_HUK;
#endif /* TFM_HUK_RANDOM_GENERATION */
  int32_t err;
  uint32_t crc = 0U;
  __IO NVCNT_ELEMENT_TYPE element;
  int32_t loop = sizeof(huk) / sizeof(NVCNT_DATA_TYPE) - 1;
  uint32_t address = BL2_NV_COUNTERS_AREA_ADDR;
#ifdef TFM_HUK_RANDOM_GENERATION
  /* generate random number */
  mbedtls_hardware_poll(NULL, (uint8_t *)&huk, sizeof(huk), &len);
  BOOT_LOG_INF("BL2 HUK generated = %x%x..%x%x", huk[0], huk[1], huk[6], huk[7]);
  if (len != sizeof(huk))
  {
    BOOT_LOG_ERR("BL2 HUK generation Failed !!");
    Error_Handler();
  }
#else
  huk[0] = NVCNT_HEADER_VALUE;
#endif /* TFM_HUK_RANDOM_GENERATION */
  /*  write the HUK in header */
  while (loop >= 0)
  {
    /* store in revert order , read is done in revert at the end all is in order */
    /* compute crc */
    crc = CalculateCrc(huk[loop], huk_random_id);
    /*  build element  */
    element = NVCNT_ELEMENT_VALUE(huk_random_id, huk[loop], crc);
    /* write element  */
    err = FLASH_DEV_NAME.ProgramData(address,
                                     (const void *)&element,
                                     NVCNT_ELEMENT_SIZE);
    if (err != ARM_DRIVER_OK)
    {
      break;
    }
    address += sizeof(NVCNT_ELEMENT_TYPE);
    loop--;
  }

  /* clean huk footprint  */
  element = 0;
  memset((void *)huk, 0, sizeof(huk));
  if (err == ARM_DRIVER_OK)
  {
    return true;
  }
  else return false;
}
#ifdef TFM_HUK_RANDOM_GENERATION
/**
  * @brief  This function writes the HUK in BL2 DATA SHARED.
  * @param : huk  pointer to uint8_t array
  * @param : huk_size array size
  * @retval boolean return true on success
  */
static bool write_huk(const uint8_t *huk, uint32_t huk_size)
{
  enum shared_memory_err_t res;
  res = boot_add_data_to_shared_area(TLV_MAJOR_SST,
                                     TLV_MINOR_CORE_HUK,
                                     huk_size,
                                     (const uint8_t *)huk);
  if (res)
  {
    return false;
  }
  BOOT_LOG_INF("BL2 HUK %x%x..%x%x set to BL2 SHARED DATA",
               *((uint32_t *)huk),
               *((uint32_t *)(huk + 4)),
               *((uint32_t *)(huk + 24)),
               *((uint32_t *)(huk + 28))
              );
  return true;
}
#endif /* TFM_HUK_RANDOM_GENERATION */
/**
  * @brief  This function checks the header from NVM count area
  *
  * @retval boolean return true on success
  */
static bool Check_Header(void)
{

