STMicroelectronics/STM32CubeL5/Projects/STM32L562E-DK/Applications/TFM/TFM_SBSFU/Src/bl2_nv_services.c
#ifdef TFM_HUK_RANDOM_GENERATION
  /* Set to __IO to force value cleaning */
  __IO NVCNT_ELEMENT_TYPE addressvalue = 0U;
  __IO NVCNT_DATA_TYPE huk[HUK_SIZE / sizeof(NVCNT_DATA_TYPE)];
#else
  NVCNT_ELEMENT_TYPE addressvalue;
  __IO NVCNT_DATA_TYPE huk[1];
#endif /* TFM_HUK_RANDOM_GENERATION */
  uint32_t  crc = 0U;
  int32_t err;
  bool ret = true;
  int32_t loop = sizeof(huk) / sizeof(NVCNT_DATA_TYPE) - 1;
  uint32_t address = BL2_NV_COUNTERS_AREA_ADDR;
  /* Check each page address starting from end */
  /* Get the current location content to be compared with virtual address */
  while (loop >= 0)
  {
    err = FLASH_DEV_NAME.ReadData(address, (void *)&addressvalue,
                                  sizeof(addressvalue));
    if ((err == ARM_DRIVER_OK) && (addressvalue != NVCNT_PAGESTAT_ERASED))
    {
      crc = CalculateCrc(NVCNT_DATA_VALUE(addressvalue), NVCNT_ID_VALUE(addressvalue));

      /* if crc verification pass, data is correct and is returned.
         if crc verification fails, data is corrupted and has to be skip */
      if (crc == NVCNT_CRC_VALUE(addressvalue))
      {
        /* recopy key in revert order  */
        huk[loop] = NVCNT_DATA_VALUE(addressvalue);
      }
      else
        ret = false;
    }
    address += sizeof(NVCNT_ELEMENT_TYPE);
    loop--;
  }
#ifdef TFM_HUK_RANDOM_GENERATION
  if (ret)
  {
    ret = write_huk((const uint8_t *)huk, sizeof(huk));
  }
  memset((void *)huk, 0, sizeof(huk));
  addressvalue  = 0;
#else
  if (huk[0] != NVCNT_HEADER_VALUE)
  {
    ret = false;
  }
#endif /* TFM_HUK_RANDOM_GENERATION */
  return ret;
}
/**
  * @brief  init counter data in NV area.
  * @retval bool : true if success
                 false if failed
  */
static inline bool init_counter(void)
{
  int32_t err;
  uint32_t crc = 0U;
  NVCNT_ELEMENT_TYPE element;
  enum tfm_nv_counter_t counter_id;
  const uint32_t data = NVCNT_INIT_VALUE;

  /* initialize only one counter */
  for (counter_id = PLAT_NV_COUNTER_3; counter_id < PLAT_NV_COUNTER_MAX; counter_id++)
  {

    /* Check if pages are full, i.e. max number of written elements achieved */
    if (uhNbWrittenElements >= NVCNT_MAX_WRITTEN_ELEMENTS)
    {
      return false;
    }

    /* Calculate crc of variable data and virtual address */
    crc = CalculateCrc(data, counter_id);
    /*  build element  */
    element = NVCNT_ELEMENT_VALUE(counter_id, data, crc);
    /* Program variable data + virtual address + crc */
    err = FLASH_DEV_NAME.ProgramData(BL2_NV_COUNTERS_AREA_ADDR + uwAddressNextWrite,
                                     &element,
                                     NVCNT_ELEMENT_SIZE);
    /* If program operation was failed, a Flash error code is returned */
    if (err != ARM_DRIVER_OK)
    {
      return false;
    }

    /* Increment global variables relative to write operation done*/
    uwAddressNextWrite += NVCNT_ELEMENT_SIZE;
    uhNbWrittenElements++;
  }
  return true;
}
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
